name = 'Tom'
height = 2
weight = 65

bmi = weight/(height ** 2)
print('Індекс маси тіла: {:.1f}'.format(bmi))
if bmi < 18:
    print('У ' + name + ' не достатня вага. Вам потрібно краще харчуватись')
elif bmi < 25:
    print('У '+ name + ' нема зайвої ваги')
elif bmi == 25:
    print('У ' + name + ' ідеальна вага')
else:
    print('У ' + name + ' зайва вага')
# Для виведення однієї цифри після десяткової крапки можна скористатись методом format і використати шаблон
# форматування числа з плаваючою точкою з однією цифрою після крапки {:.1f}.
# Також, можна замість використання методу str() для перетворення числа у рядок,
# просто використати рядковий метод .format() для підстановки числа у рядок.

# ! Також можна використати f-рядки (f-strings) для досягнення того ж ефекту, як у попередньому прикладі.
# !  Ось як це можна зробити за допомогою f-рядка:
# ? print(f'Індекс маси тіла: {bmi:.1f}')
if bmi < 18:
    print('У ' + name + ' не достатня вага. Вам потрібно краще харчуватись')
elif 18 <= bmi < 25:
    print('У ' + name + ' нема зайвої ваги')
elif bmi == 25:
    print('У ' + name + ' ідеальна вага')
else:
    print('У ' + name + ' зайва вага')

