# int - ціле число (1, 34, 300 )
# float - числа з плаваючою крапкою (2.45 , 100.45, 0.57)
#str - впорядкований набір символів ('hello', '100' , 'bey')
# list - індексована колекція елементів  [10, "helo", 10.23]
# dict - набір НЕ впорякованих пар ключ:значення {'key':12, 'key':'hello'}
# tup - НЕ змінна (immutable) впорядкованність послідовних об'єктів (10, "helo", 10.23)
# set - не впорядкований набір унікальних об'єктів {'a', 'b'}
# bool = бульвое значення True, False

#? АРИФМЕНТИЧНІ ДІЇ
a = 1 + 3
print(a)
b = 4 - 2
print(b)
c = 3 * 5
print(c)
d = 8 / 2
print(d)
# ділення без остачі
e = 7 // 3
print(e)
# остача від ділення
f = 7 % 4
print(f)
j = 3 ** 2
print(j)
# значення корення
h = 9 ** 0.5
print(h)

#* Python дозволяє додавати, віднімати, множити і ділити числа з перепризначенням за допомогою
# + =,  - =,  * =,  і/=.