list1 = [1,1,2,2,3,4,5,6,1,1]
print(set(list1))

# set - це колекція (контейнер), який містить набір унікальних і неупорядкованих елементів.
# Основна особливість множини в тому, що вона не допускає наявності дублікатів.
#
# Ініціалізувати множину можна як за допомогою функції set(), так і з використанням фігурних дужок {}.
#
# Основні операції, які можна виконувати над множинами в Python:
#
# Додавання елементів: set.add()
# Видалення елементів: set.remove() або set.discard()
# Перевірка наявності елемента: x in set
# Отримання кількості елементів: len(set)
# Об'єднання двох множин: set.union() або set |
# Перетин двох множин: set.intersection() або set &
# Різниця двох множин: set.difference() або set -
# Симетрична різниця двох множин: set.symmetric_difference() або set ^